Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetPolyloops
Gets the collection of planar polygons describing the opening geometry.
Remarks:
A collection of polyloops (planar polygons) describing the opening geometry as described
in gbXML. The geometry is currently measured per analytical(center-line).
Returns:
The collection of polygons describing the opening geometry.
Since:
2023

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetWindowType
Gets the analytic window type this surface is associated with.
Returns:
The analytic window type.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetConstruction
Gets the analytic construction this surface is associated with.
Returns:
The analytic construction.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OriginatingElementName
The name for the originating Revit element.
Remarks:
Opening elements get an originating element assigned according to the below described schema, based on associative room bounding element:
(Family Name) : (Family Type)Sample:
Basic Wall : Cast Concrete Wall 12"
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OriginatingElementId
The element id for the originating Revit element.
Since:
2024